Repository: ScoopXDev/ScoopX
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# SettingsTitle.Text
source: Settings
zh_cn: 设置

# SettingsAppearanceHeader.Text
source: Appearance
zh_cn: 外观设置

# SettingsThemeLight.Text
source: Light
zh_cn: 浅色模式

# SettingsThemeDark.Text
source: Dark
zh_cn: 深色模式

# SettingsThemeSystem.Text
source: System
zh_cn: 跟随系统

# SettingsLanguageHeader.Text
source: Language
zh_cn: 语言设置

# SettingsGeneralHeader.Text
source: General
zh_cn: 常规设置

# SettingsCloseToTrayTitle.Text
source: Minimize to tray on close
zh_cn: 关闭时最小化到托盘

# SettingsCloseToTrayDesc.Text
source: Hide to the system tray instead of quitting
zh_cn: 关闭窗口时隐藏到系统托盘，而不是退出

# SettingsStartWithWindowsTitle.Text
source: Start with Windows
zh_cn: 开机时启动

# SettingsStartWithWindowsDesc.Text
source: Launch ScoopX automatically after signing in to Windows
zh_cn: 登录 Windows 后自动启动 ScoopX

# SettingsStartHiddenTitle.Text
source: Hide to tray on startup
zh_cn: 启动时隐藏到托盘

# SettingsStartHiddenDesc.Text
source: Don't show the main window on startup—tray icon only
zh_cn: 启动后不显示主窗口，仅显示托盘图标

# SettingsPathsHeader.Text
source: Paths
zh_cn: 路径设置

# SettingsScoopRootLabel.Text
source: Scoop root
zh_cn: Scoop 根目录

# SettingsScoopRootPlaceholder.PlaceholderText
source: Choose Scoop root folder
zh_cn: 选择 Scoop 根目录

# SettingsWebsitesRootLabel.Text
source: Default websites root
zh_cn: 网站默认根目录

# SettingsWebsitesRootPlaceholder.PlaceholderText
source: Choose default websites root folder
zh_cn: 选择网站默认根目录

# SettingsBrowseScoop.Content
source: Browse
zh_cn: 浏览

# SettingsBrowseWebsites.Content
source: Browse
zh_cn: 浏览

# SettingsAboutHeader.Text
source: About
zh_cn: 关于

# SettingsGitHub.Content
source: GitHub
zh_cn: GitHub 仓库

# SettingsVersionFormat
source: Version {0}
zh_cn: 版本 {0}

# SettingsLanguageRestartTitle
source: Change language
zh_cn: 切换语言

# SettingsLanguageRestartMessage
source: Language applies after restart. Restart now?
zh_cn: 语言将在重启应用后生效。是否立即重启？

# SettingsLanguageRestartNow
source: Restart
zh_cn: 立即重启

# SettingsLanguageLater
source: Later
zh_cn: 稍后

# SettingsLanguageRestartFailedTitle
source: Could not restart
zh_cn: 无法自动重启

# SettingsLanguageRestartFailedMessage
source: Could not start a new process. Please close and reopen ScoopX manually for the language change to take effect.
zh_cn: 无法启动新进程。请手动关闭并重新打开 ScoopX，以使语言设置生效。

# SettingsLanguageRestartFailedOk
source: OK
zh_cn: 确定

# SettingsStartupFailedTitle
source: Could not change startup setting
zh_cn: 无法更改开机自启

# SettingsStartupFailedOk
source: OK
zh_cn: 确定

# SettingsStartupDisabled
source: Could not enable start with Windows (it may be disabled by policy or the user).
zh_cn: 未能启用开机自启（可能被系统或用户策略禁用）。

# SettingsStartupExeMissing
source: Could not locate ScoopX.exe. Start with Windows was not enabled.
zh_cn: 无法定位 ScoopX.exe，未能启用开机自启。

# SettingsStartupRegistryOpenFailed
source: Could not open the Run registry key.
zh_cn: 无法打开注册表 Run 键。

# SettingsStartupRegistryFailed
source: Could not change start with Windows: {0}
zh_cn: 无法设置开机自启：{0}

# SettingsLanguageApplyFailedTitle
source: Could not change language
zh_cn: 无法切换语言

# SettingsLanguageApplyFailedMessage
source: Your language preference was saved, but it could not be applied now. Restart the app or check system language settings.
zh_cn: 语言偏好已保存，但当前无法应用。请重启应用或检查系统语言设置。

# SettingsLanguageApplyFailedOk
source: OK
zh_cn: 确定

# TitleSlogan.Text
source: A more efficient Windows development environment for every developer.
zh_cn: 为每一位PHP开发者打造高效开发环境，专注每一次创造。

# NavHome.Text
source: Home
zh_cn: 首页

# NavWebsites.Text
source: Sites
zh_cn: 网站

# NavDatabase.Text
source: Database
zh_cn: 数据库

# NavStore.Text
source: Store
zh_cn: 应用商店

# NavSettings.Text
source: Settings
zh_cn: 设置

# TrayShow.Text
source: Show window
zh_cn: 显示主窗口

# TrayExit.Text
source: Exit ScoopX
zh_cn: 退出 ScoopX

# CaptionMinimize.ToolTipService.ToolTip
source: Minimize
zh_cn: 最小化

# CaptionClose.ToolTipService.ToolTip
source: Close
zh_cn: 关闭

# HomeStatusTitle.Text
source: Status
zh_cn: 状态

# HomeDiskIoTitle.Text
source: Disk IO
zh_cn: 磁盘IO

# HomeDiskFilterLabel.Text
source: Disk
zh_cn: 磁盘

# HomeDiskFilterAll
source: All
zh_cn: 所有

# HomeDiskReadLabel.Text
source: Read
zh_cn: 读取

# HomeDiskWriteLabel.Text
source: Write
zh_cn: 写入

# HomeDiskOpsFormat
source: {0} ops/s
zh_cn: 每秒读写 {0} 次

# HomeDiskLatencyLabel.Text
source: IO latency
zh_cn: IO延迟

# HomeGaugeLoad
source: Load
zh_cn: 负载

# HomeGaugeMemory
source: Memory
zh_cn: 内存

# HomeCpuCoresFormat
source: {0} cores
zh_cn: {0}核心

# HomeLoadSmooth
source: Running smoothly
zh_cn: 运行流畅

# HomeLoadModerate
source: Moderate load
zh_cn: 负载适中

# HomeLoadHigh
source: High load
zh_cn: 负载偏高

# HomeLoadCritical
source: Critical load
zh_cn: 负载过高

# SitesAdd.Content
source: Add site
zh_cn: 添加站点

# SitesAdvanced.Content
source: Advanced
zh_cn: 高级设置

# SitesDefaultPage.Text
source: Default page
zh_cn: 修改默认页面

# SitesPhpCli.Text
source: PHP CLI version
zh_cn: PHP命令行版本

# SitesFilterAll.Content
source: All categories
zh_cn: 全部分类

# SitesFilterRunning.Content
source: Running
zh_cn: 运行中

# SitesFilterStopped.Content
source: Stopped
zh_cn: 已停止

# SitesSearch.PlaceholderText
source: Search domain or remark
zh_cn: 请输入域名或备注

# SitesColName.Text
source: Site name
zh_cn: 网站名称

# SitesColStatus.Text
source: Status
zh_cn: 状态

# SitesColRoot.Text
source: Root path
zh_cn: 根目录

# SitesColRemark.Text
source: Remark
zh_cn: 备注信息

# SitesColPhp.Text
source: PHP
zh_cn: PHP版本

# SitesColActions.Text
source: Actions
zh_cn: 操作

# SitesActionSettings.Content
source: Settings
zh_cn: 设置

# SitesActionDelete.Content
source: Delete
zh_cn: 删除

# SitesEditTooltip.ToolTipService.ToolTip
source: Edit site
zh_cn: 点击编辑站点

# SitesToggleTooltip.ToolTipService.ToolTip
source: Start or stop site
zh_cn: 点击启停站点

# SitesBatchPlaceholder.PlaceholderText
source: Select batch action
zh_cn: 请选择批量操作

# SitesBatchStart.Content
source: Start sites
zh_cn: 启动站点

# SitesBatchStop.Content
source: Stop sites
zh_cn: 停用站点

# SitesBatchPhpFormat
source: Set PHP {0}
zh_cn: 设置PHP版本 {0}

# SitesBatchDelete.Content
source: Delete sites
zh_cn: 删除站点

# SitesBatchSelectedFormat
source: Batch ({0} selected)
zh_cn: 批量操作 (已选中{0}项)

# SitesPrevPage.ToolTipService.ToolTip
source: Previous page
zh_cn: 上一页

# SitesNextPage.ToolTipService.ToolTip
source: Next page
zh_cn: 下一页

# SitesPageSizeFormat
source: {0} / page
zh_cn: {0}条/页

# SitesTotalFormat
source: {0} total
zh_cn: 共 {0} 条

# SitesGoto.Text
source: Go
zh_cn: 前往

# SitesPageUnit.Text
source: page
zh_cn: 页

# SitesOpenFailedTitle
source: Cannot open
zh_cn: 无法打开

# SitesOpenFailedMessage
source: Folder does not exist: {0}
zh_cn: 目录不存在： {0}

# SitesOpenFailedOk
source: OK
zh_cn: 确定

# SitesStartedTitle
source: Started
zh_cn: 已启动

# SitesStartedMessage
source: Site {0} started
zh_cn: 站点 {0} 已启动

# SitesStoppedTitle
source: Stopped
zh_cn: 已停止

# SitesStoppedMessage
source: Site {0} stopped
zh_cn: 站点 {0} 已停止

# AddSiteDialog.Title
source: Add site
zh_cn: 添加站点

# AddSiteDialog.PrimaryButtonText
source: Cancel
zh_cn: 取消

# AddSiteDialog.SecondaryButtonText
source: OK
zh_cn: 确定

# AddSiteDomain.Text
source: Domain
zh_cn: 域名

# AddSiteDomainHint.Text
source: One domain per line; you can add multiple sites at once
zh_cn: 每行一个域名，可一次添加多个站点

# AddSiteRemark.Text
source: Remark
zh_cn: 备注

# AddSiteRemarkPlaceholder.PlaceholderText
source: Optional
zh_cn: 可选

# AddSiteRoot.Text
source: Root path
zh_cn: 根目录

# AddSiteRootHint.Text
source: Site files will be stored under this folder
zh_cn: 站点文件将保存在此目录下

# AddSiteRootPlaceholder.PlaceholderText
source: Choose site root folder
zh_cn: 选择网站根目录

# AddSiteBrowse.Content
source: Browse
zh_cn: 浏览

# AddSiteDatabase.Text
source: Database
zh_cn: 数据库

# AddSiteDatabaseHint.Text
source: Optionally create a database account for the site
zh_cn: 可为站点同时创建数据库账号

# AddSiteDbNone.Content
source: Do not create
zh_cn: 不创建

# AddSiteDbUser.Text
source: Database user
zh_cn: 数据库账号

# AddSiteDbUserPlaceholder.PlaceholderText
source: Username
zh_cn: 账号

# AddSiteDbPassword.Text
source: Database password
zh_cn: 数据库密码

# AddSiteDbPasswordPlaceholder.PlaceholderText
source: Password
zh_cn: 密码

# AddSitePhp.Text
source: PHP version
zh_cn: PHP 版本

# AddSitePhpHint.Text
source: PHP version used when the site is running
zh_cn: 站点运行时使用的 PHP 版本

# EditSiteDialog.Title
source: Edit site
zh_cn: 编辑站点

# EditSiteNavDomains.Text
source: Domains
zh_cn: 域名管理

# EditSiteNavDirectory.Text
source: Site directory
zh_cn: 网站目录

# EditSiteNavRewrite.Text
source: Rewrite rules
zh_cn: 伪静态设置

# EditSiteNavDefaultDoc.Text
source: Default documents
zh_cn: 默认文档

# EditSiteNavConfig.Text
source: Config file
zh_cn: 配置文件

# EditSiteNavPhp.Text
source: PHP version
zh_cn: PHP 版本

# EditSiteNavLogs.Text
source: Site logs
zh_cn: 网站日志

# EditSiteDomainsTitle.Text
source: Domains
zh_cn: 域名管理

# EditSiteBasicInfo.Text
source: Basic info
zh_cn: 基本信息

# EditSiteDomain.Text
source: Site domain
zh_cn: 网站域名

# EditSiteRemark.Text
source: Remark
zh_cn: 备注

# EditSiteRemarkPlaceholder.PlaceholderText
source: Optional
zh_cn: 可选

# EditSiteStatus.Text
source: Status
zh_cn: 运行状态

# EditSiteStatusRunning.Content
source: Running
zh_cn: 运行中

# EditSiteStatusStopped.Content
source: Stopped
zh_cn: 已停止

# EditSiteDirectoryTitle.Text
source: Site directory
zh_cn: 网站目录

# EditSiteStorage.Text
source: Storage
zh_cn: 存储

# EditSiteRoot.Text
source: Root path
zh_cn: 根目录

# EditSiteRootPlaceholder.PlaceholderText
source: Choose site root folder
zh_cn: 选择网站根目录

# EditSiteBrowseRoot.Content
source: Browse
zh_cn: 浏览

# EditSiteRunPath.Text
source: Run path
zh_cn: 运行目录

# EditSiteRunPathPlaceholder.PlaceholderText
source: Choose site run folder
zh_cn: 选择网站运行目录

# EditSiteBrowseRun.Content
source: Browse
zh_cn: 浏览

# EditSiteRewriteTitle.Text
source: Rewrite rules
zh_cn: 伪静态设置

# EditSiteRules.Text
source: Rules
zh_cn: 规则

# EditSiteRuleTemplate.Text
source: Rule template
zh_cn: 规则模板

# EditSiteRewriteNone.Content
source: None
zh_cn: 不使用

# EditSiteRewriteCustom.Content
source: Custom
zh_cn: 自定义

# EditSiteRewriteRules.Text
source: Rewrite rules
zh_cn: 伪静态规则

# EditSiteRewriteRulesPlaceholder.PlaceholderText
source: Enter rewrite rules here
zh_cn: 在此填写伪静态规则

# EditSiteDefaultDocTitle.Text
source: Default documents
zh_cn: 默认文档

# EditSiteDocList.Text
source: Document list
zh_cn: 文档列表

# EditSiteDocListHint.Text
source: One per line, matched top to bottom by priority
zh_cn: 每行一个，按优先级从上到下匹配

# EditSiteConfigTitle.Text
source: Config file
zh_cn: 配置文件

# EditSiteConfigGroup.Text
source: Site config
zh_cn: 站点配置

# EditSiteConfigHint.Text
source: Edit the site virtual host configuration directly
zh_cn: 可直接编辑站点虚拟主机配置

# EditSitePhpTitle.Text
source: PHP version
zh_cn: PHP 版本

# EditSiteRuntime.Text
source: Runtime
zh_cn: 运行环境

# EditSitePhpVersion.Text
source: Runtime version
zh_cn: 运行版本

# EditSitePhpHint.Text
source: Takes effect for this site immediately after switching
zh_cn: 切换后对该站点立即生效

# EditSiteLogsTitle.Text
source: Site logs
zh_cn: 网站日志

# EditSiteLogType.Text
source: Log type
zh_cn: 日志类型

# EditSiteLogAccess.Content
source: Access log
zh_cn: 访问日志

# EditSiteLogError.Content
source: Error log
zh_cn: 错误日志

# EditSiteLogRefresh.Content
source: Refresh
zh_cn: 刷新

# EditSiteLogFullscreen.Content
source: Fullscreen
zh_cn: 全屏展示

# EditSiteCancel.Content
source: Cancel
zh_cn: 取消

# EditSiteConfirm.Content
source: OK
zh_cn: 确定

# EditSiteLogExitFullscreen.Content
source: Exit fullscreen
zh_cn: 退出全屏

# DbMySqlAddDatabase.Content
source: Add database
zh_cn: 添加数据库

# DbMySqlRootPassword.Content
source: root password
zh_cn: root密码

# DbMySqlRemoteDatabase.Content
source: Remote database
zh_cn: 远程数据库

# DbMySqlStop.Content
source: Stop
zh_cn: 停止

# DbMySqlRestart.Content
source: Restart
zh_cn: 重启

# DbMySqlReload.Content
source: Reload
zh_cn: 重载

# AddDatabaseDialog.Title
source: Add database
zh_cn: 添加数据库

# AddDatabaseDialog.PrimaryButtonText
source: Cancel
zh_cn: 取消

# AddDatabaseDialog.SecondaryButtonText
source: OK
zh_cn: 确定

# AddDatabaseName.Text
source: Database name
zh_cn: 数据库名

# AddDatabaseNamePlaceholder.PlaceholderText
source: Enter database name
zh_cn: 请输入数据库名

# AddDatabaseCharset.Text
source: Character set
zh_cn: 数据库编码

# AddDatabaseUsername.Text
source: Username
zh_cn: 用户名

# AddDatabaseUsernamePlaceholder.PlaceholderText
source: Enter username
zh_cn: 请输入用户名

# AddDatabasePassword.Text
source: Password
zh_cn: 密码

# AddDatabasePasswordPlaceholder.PlaceholderText
source: Enter password
zh_cn: 请输入密码

# AddDatabaseRemark.Text
source: Remark
zh_cn: 备注

# AddDatabaseRemarkPlaceholder.PlaceholderText
source: Optional
zh_cn: 可选

# DbColName.Text
source: Database
zh_cn: 数据库名

# DbColUsername.Text
source: Username
zh_cn: 用户名

# DbColPassword.Text
source: Password
zh_cn: 密码

# DbColRemark.Text
source: Remark
zh_cn: 备注

# DbColActions.Text
source: Actions
zh_cn: 操作

# DbActionManage.Content
source: Manage
zh_cn: 管理

# DbActionChangePassword.Content
source: Change pwd
zh_cn: 改密

# DbActionDelete.Content
source: Delete
zh_cn: 删除

# DbListEmpty.Text
source: No databases yet. Click “Add database” to create one.
zh_cn: 暂无数据库，点击「添加数据库」创建

# DbDeleteConfirm
source: Delete this database?
zh_cn: 确定删除该数据库吗？

# DbDeleteCancel
source: Cancel
zh_cn: 取消

# DbDeleteOk
source: Delete
zh_cn: 删除
